SoapDemo/request.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetPostcodeAndSuburbForAustralia xmlns="http://www.ssw.com.au/PostcodeWebservice">
      <txtSuburb>%@</txtSuburb>
      <txtState>%@</txtState>
      <txtPostCode>%@</txtPostCode>
    </GetPostcodeAndSuburbForAustralia>
  </soap:Body>
</soap:Envelope>